БИТУправление_медицинским_центром_демо/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.ЛистОжидания</types>
      <types>DocumentRef.Событие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезСкидок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенесенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДляОтката</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХочуРаньше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеХочуРаньше</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборХочуРаньше</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗаписиВРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДлительностиЗаявки</name>
    <type>
      <types>EnumRef.РежимДлительностиЗаявки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование1</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование2</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование3</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьИзмененаВручную</name>
      <comment>Используется в форме заявки при установке нормативной продолжительности</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборыХочуРаньше</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/Лиды/Forms/ИзменениеСрокаЖизниЛида/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СрокЖизниЛида = Параметры.СрокЖизниЛида;
	КоличествоКлиентов = ПолучитьКоличествоКлиентов();
	КоличествоНеобработанныхКлиентов = ПолучитьКоличествоКлиентов(Истина);
	КоличествоОбработанныхКлиентов = Строка(КоличествоКлиентов-КоличествоНеобработанныхКлиентов) + "/" + Строка(КоличествоКлиентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьВсехКлиентов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеВопросаИзмененияКоличестваСрокЖизниЛида", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Будет произведен пересчет лидов по всем клиетам. Это займет некоторое время.'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОставшихсяКлиентов(Команда)
	
	ОбработанныеКлиенты = Новый Массив;
	
	КоличествоИтераций = Окр(КоличествоНеобработанныхКлиентов/100+0.5,0,0);
	
	Для НомерИтерации = 1 По КоличествоИтераций Цикл
		
		Состояние(НСтр("ru='Обработано клиентов'"), (1-КоличествоНеобработанныхКлиентов/КоличествоКлиентов)*100);
		Пересчет(ОбработанныеКлиенты, КоличествоНеобработанныхКлиентов, Истина);
		КоличествоОбработанныхКлиентов = Строка(КоличествоКлиентов-КоличествоНеобработанныхКлиентов) + "/" + Строка(КоличествоКлиентов);
		НастроитьВидимость();
		ОбработкаПрерыванияПользователя();
	 	
	КонецЦикла;
	Состояние(НСтр("ru='Обработано клиентов'"), (1-КоличествоНеобработанныхКлиентов/КоличествоКлиентов)*100);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	КоличествоКлиентов = ПолучитьКоличествоКлиентов();
	КоличествоНеобработанныхКлиентов = ПолучитьКоличествоКлиентов(Истина);
	КоличествоОбработанныхКлиентов = Строка(КоличествоКлиентов-КоличествоНеобработанныхКлиентов) + "/" + Строка(КоличествоКлиентов);
	НастроитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьВидимость()
	
	ВозможностьОбработатьОставшихсяКлиентов = КоличествоКлиентов <> КоличествоНеобработанныхКлиентов И КоличествоНеобработанныхКлиентов > 0;
	Элементы.КоличествоОбработанныхКлиентов.Видимость = ВозможностьОбработатьОставшихсяКлиентов;
	Элементы.ОбработатьОставшихсяКлиентов.Видимость = ВозможностьОбработатьОставшихсяКлиентов;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВопросаИзмененияКоличестваСрокЖизниЛида(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОбработанныеКлиенты = Новый Массив;
		УдалитьЛиды();
		УправлениеНастройками.УстановитьЗначениеПараметраУчетнойПолитики("СрокЖизниЛида", СрокЖизниЛида);
		
		КоличествоИтераций = Окр(КоличествоКлиентов/100+0.5,0,0);
		
		ЗаголовокСостояния = НСтр("ru='Нажмите Ctrl+Break, чтобы прервать'");
		Для НомерИтерации = 1 По КоличествоИтераций Цикл
			
			Состояние(НСтр("ru='Обработано клиентов'"), ОбработанныеКлиенты.Количество()/КоличествоКлиентов*100, ЗаголовокСостояния);
			Пересчет(ОбработанныеКлиенты, КоличествоНеобработанныхКлиентов);
			КоличествоОбработанныхКлиентов = Строка(КоличествоКлиентов-КоличествоНеобработанныхКлиентов) + "/" + Строка(КоличествоКлиентов);
			НастроитьВидимость();
			ОбработкаПрерыванияПользователя();
			
		КонецЦикла;
		Закрыть(СрокЖизниЛида);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЛиды()
	РегистрыСведений.Лиды.СоздатьНаборЗаписей().Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Пересчет(ОбработанныеКлиенты, КоличествоНеобработанныхКлиентов, ТолькоНеобработанные = Ложь)
	
	КоличествоКлиентовВТранзакции = 20;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Клиент КАК Клиент
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заявка.Клиент
		|		ИЗ
		|			Документ.Заявка КАК Заявка) КАК СобытияПоКлиенту
		|		ПО Клиенты.Ссылка = СобытияПоКлиенту.Клиент
		|ГДЕ
		|	НЕ Клиенты.Ссылка В (&ОбработанныеКлиенты)
		|	";
	
	Если ТолькоНеобработанные Тогда
		Запрос.Текст = Запрос.Текст + " И Клиенты.Ссылка Не В (ВЫБРАТЬ Различные(Лиды.Клиент) Из РегистрСведений.Лиды КАК Лиды)";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбработанныеКлиенты", ОбработанныеКлиенты);
	
	Клиенты = Запрос.Выполнить().Выгрузить();
	КоличествоИтераций = Окр(Клиенты.Количество()/КоличествоКлиентовВТранзакции+0.5,0,0);
	
	Для НомерИтерации = 1 По КоличествоИтераций Цикл
		КлиентыКУдалению = Новый Массив;
		НачатьТранзакцию();
		Для Каждого Клиент Из Клиенты Цикл
			Если Клиенты.Индекс(Клиент) = КоличествоКлиентовВТранзакции Тогда
				Прервать;
			КонецЕсли;
			
			ДобавитьЛидыПоКлиенту(Клиент.Ссылка);
			
			КлиентыКУдалению.Добавить(Клиент.Ссылка);
			ОбработанныеКлиенты.Добавить(Клиент.Ссылка);
			КоличествоНеобработанныхКлиентов = КоличествоНеобработанныхКлиентов-1;
		КонецЦикла;
		
		Для Каждого КлиентКУдалению Из КлиентыКУдалению Цикл
			Клиенты.Удалить(Клиенты.НайтиСтроки(Новый Структура("Ссылка", КлиентКУдалению))[0]);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЛидыПоКлиенту(Клиент)
	
	ДатаПервогоСобытия = ПолучитьДатуПервогоСобытия(Клиент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Событие.Ссылка КАК Ссылка,
		|	Событие.ДатаФакт КАК Дата
		|ИЗ
		|	Документ.Событие КАК Событие
		|ГДЕ
		|	Событие.ПометкаУдаления = ЛОЖЬ
		|	И Событие.ИсточникИнформации <> ЗНАЧЕНИЕ(Справочник.ИсточникиИнформации.ПустаяСсылка)
		|	И Событие.Клиент = &Клиент
		|	И Событие.ДатаФакт <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистОжидания.Ссылка,
		|	ЛистОжидания.Дата
		|ИЗ
		|	Документ.ЛистОжидания КАК ЛистОжидания
		|ГДЕ
		|	ЛистОжидания.ПометкаУдаления = ЛОЖЬ
		|	И ЛистОжидания.ИсточникИнформации <> ЗНАЧЕНИЕ(Справочник.ИсточникиИнформации.ПустаяСсылка)
		|	И ЛистОжидания.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.Параметры.Вставить("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 И ДатаПервогоСобытия <> Неопределено Тогда
		РегистрыСведений.Лиды.ДобавитьЛид(Новый Структура("Клиент, Период", Клиент, ДатаПервогоСобытия));
	КонецЕсли;
	
	ПустойЛидСоздан = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Не ПустойЛидСоздан И ДатаПервогоСобытия <> Неопределено И НачалоДня(ДатаПервогоСобытия) < НачалоДня(Выборка.Дата) Тогда
			РегистрыСведений.Лиды.ДобавитьЛид(Новый Структура("Клиент, Период, ДатаОкончания", Клиент, ДатаПервогоСобытия, НачалоДня(Выборка.Дата)-1));
			ПустойЛидСоздан = Истина;
		КонецЕсли;
		РегистрыСведений.Лиды.ДобавитьПервичныйЛид(Новый Структура("Клиент, Лид, Период", Клиент, Выборка.Ссылка, Выборка.Дата), Новый Структура("ПометкаНаУдаление", Ложь), Не ПустойЛидСоздан);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуПервогоСобытия(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Продажи.Период) КАК Дата
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Клиент = &Клиент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(Заявка.Дата)
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Клиент = &Клиент
	|	И Заявка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Если ЗначениеЗаполнено(РезультатЗапроса.Дата) Тогда
			Возврат РезультатЗапроса.Дата;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоличествоКлиентов(ТолькоНеобработанные = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Клиенты.Ссылка) КАК КоличествоКлиентов
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Клиент КАК Клиент
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Заявка.Клиент
		|		ИЗ
		|			Документ.Заявка КАК Заявка) КАК СобытияПоКлиенту
		|		ПО Клиенты.Ссылка = СобытияПоКлиенту.Клиент
		|";
	
	Если ТолькоНеобработанные Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ Клиенты.Ссылка Не В (ВЫБРАТЬ Различные(Лиды.Клиент) Из РегистрСведений.Лиды КАК Лиды)";
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
	    Возврат Результат.Выгрузить()[0].КоличествоКлиентов;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
